Repository: kenichisutan/canadian-budget-en-fr-sentiment-analysis
Catalog: data/corpora/federal-budget/budget-2025-en-budget-2025-fr.tmx
Source language: en_en
Languages: fr_fr

source: defence industry, Canada's new government is accelerating investments to meet the North Atlantic
fr_fr: l'industrie de la défense du pays, le nouveau gouvernement du Canada accélère ses investissements en

source: Treaty Organization's (NATO) 2 per cent of gross domestic product (GDP) target this year
fr_fr: vue d'atteindre cette année la cible de 2 % du produit intérieur brut (PIB) fixée par

source: and put Canada on a pathway to meet the NATO Defence Investment Pledge of investing
fr_fr: l'Organisation du traité de l'Atlantique Nord (OTAN) et pour que le Canada soit en bonne voie

source: 5 per cent of GDP in defence by 2035.
fr_fr: d'investir 5 % de son PIB dans le secteur de la défense d'ici 2035, conformément à l'engagement

source: As part of this pledge, Canada will invest 3.5 per cent of GDP by 2035 in core military
fr_fr: Dans le cadre de cet engagement, le Canada investira 3,5 % de son PIB d'ici 2035 pour répondre à

source: needs such as supporting the Canadian Armed Forces, modernising our military equipment and
fr_fr: des besoins essentiels sur le plan militaire, notamment pour soutenir les Forces armées canadiennes,

source: technology, and building up our defence industries.
fr_fr: moderniser notre équipement et nos technologies militaires et renforcer nos industries de défense.

source: An additional 1.5 per cent of GDP will
fr_fr: Un montant additionnel correspondant à 1,5 % du PIB sera également consacré à des

source: also be dedicated to defence and security-related investments made by all levels of Canadian
fr_fr: investissements liés à la défense et à la sécurité réalisés par tous les ordres de gouvernement au

source: government, such as telecommunications and emergency preparedness systems which serve national
fr_fr: pays, comme des investissements dans les systèmes de télécommunications et de préparation aux

source: defence and national security purposes.
fr_fr: situations d'urgence afin d'assurer la défense nationale et de la sécurité nationale.

source: The government expects that currently planned spending by
fr_fr: Le gouvernement s'attend à ce que les dépenses actuellement prévues par les gouvernements fédéral,

source: federal, provincial, territorial, and municipal governments will meet this 1.5 per cent
fr_fr: provinciaux et territoriaux, ainsi que les administrations municipales permettent d'atteindre cet

source: commitment.
fr_fr: objectif de 1,5 %.

source: Through these investments, we are giving our Canadian Armed Forces the tools they need to defend
fr_fr: Grâce à ces investissements, nous donnons à nos Forces armées canadiennes les outils nécessaires afin

source: every square foot of our sovereign territory, from the seafloor to the Arctic to cities to
fr_fr: qu'elles soient prêtes à défendre chaque mètre carré de notre territoire souverain, des fonds marins

source: cyberspace, and to protect Canadians from present and emerging threats.
fr_fr: aux villes, jusqu'au cyberespace en passant par l'Arctique, ainsi qu'à protéger la population contre

source: To protect our communities, Canada's new government is also cracking down on illegal drugs and gun
fr_fr: Par ailleurs, afin de protéger nos communautés, le nouveau gouvernement du Canada s'attaque de front

source: trafficking, hiring 1,000 new Royal Canadian Mounted Police (RCMP) personnel and 1,000 new Canada
fr_fr: la Gendarmerie royale du Canada (GRC) et 1 000 nouveaux agents à l'Agence des services

source: Border Services Agency (CBSA) officers, and making bail and sentencing laws stricter.
fr_fr: frontaliers du Canada (ASFC), et en resserrant les lois sur la mise en liberté sous caution et la

source: In September,
fr_fr: détermination des peines.

source: the government introduced new legislation to address the horrifying rise in hate, especially in
fr_fr: En septembre, le gouvernement a déposé un projet de loi pour lutter contre

source: Antisemitism and Islamophobia, and to protect religious and cultural buildings and spaces.
fr_fr: l'augmentation horrifiante de crimes haineux, en particulier l'antisémitisme et l'islamophobie et

source: government is fighting hate so that together, we can build a country where Canadians of all faiths
fr_fr: qu'ensemble, nous bâtissions un pays où les Canadiens de toutes confessions puissent vivre sans se

source: can live their lives openly, freely, and safely.
fr_fr: cacher, librement et en toute sécurité.

source: This is Canada, and in Canada, you should be able
fr_fr: Après tout, au Canada, chacun devrait pouvoir vaquer à ses

source: to wake up, get in your car, drive to work, or your place of worship, come home, and sleep soundly
fr_fr: occupations au quotidien, puis rentrer à la maison et dormir sans crainte.

source: at night.
fr_fr: Le gouvernement du Canada

source: Canada's government is committed to making that promise a reality.
fr_fr: s'engage à faire de cette promesse une réalité.

source: 4.1 Defending Our Sovereignty
fr_fr: 4.1 Défendre notre souveraineté

source: Canada must be prepared to defend our people, to secure our sovereignty, and to protect our Allies.
fr_fr: Le Canada doit être prêt à défendre sa population, à assurer sa souveraineté et à protéger ses

source: Budget 2025 lays out the government's plan to secure Canada, fulfill our responsibility to
fr_fr: alliés. Le budget de 2025 présente le plan du gouvernement pour protéger le Canada, assumer ses

source: shared security with our Allies, build a world-class defence industrial base, and establish a new Defence Investment Agency that will accelerate the procurement process.
fr_fr: responsabilités envers ses alliés en matière de sécurité partagée, bâtir une infrastructure industrielle de défense de calibre mondial et établir une nouvelle Agence de

source: Rebuilding, Rearming, and Reinvesting in the Canadian Armed Forces
fr_fr: Réinvestir pour rebâtir et réarmer les Forces armées canadiennes

source: Canadians are proud of our Armed Forces and their unwavering dedication to protect us and our
fr_fr: Les Canadiens sont fiers de leurs Forces armées et de leur dévouement sans faille pour protéger le

source: sovereignty.
fr_fr: Canada et notre souveraineté.

source: They keep people and communities safe through major disasters.
fr_fr: Elles assurent la sécurité des personnes et des communautés lors de

source: They protect our
fr_fr: grandes catastrophes.

source: sovereignty and respond to threats in our Arctic.
fr_fr: Elles protègent la souveraineté de notre territoire et répondent aux menaces

source: They contribute to NATO's deterrence and
fr_fr: Elles contribuent à l'application de mesures de dissuasion et aux efforts

source: collective security efforts around the world.
fr_fr: collectifs de sécurité de l'OTAN partout dans le monde.

source: Our Canadian Armed Forces are among the best in the
fr_fr: Les Forces armées canadiennes comptent parmi

source: world, and they deserve the capabilities necessary to succeed in an increasingly challenging threat
fr_fr: les meilleures au monde et méritent de disposer des capacités nécessaires pour réussir dans un

source: In 2013, Canada's defence spending fell to less than 1 per cent of our GDP.
fr_fr: En 2013, les dépenses militaires du Canada sont passées à moins de 1 % de son PIB.

source: It has since more than doubled in absolute terms, but more is needed.
fr_fr: Depuis, elles ont plus que doublé, en termes absolus, mais ce n'est pas encore suffisant.

source: The brave members of our
fr_fr: Les braves

source: Canadian Armed Forces who are protecting our sovereignty do not have all the resources they need for
fr_fr: membres des Forces armées canadiennes (FAC) qui protègent notre souveraineté n'ont pas toutes les

source: a riskier world.
fr_fr: Nos

source: Our military infrastructure and equipment need to be upgraded and updated, our
fr_fr: infrastructures et nos équipements militaires doivent être modernisés et mis à niveau, nos capacités

source: defence capabilities need to be rebuilt and reasserted, and we need to work with partners to further
fr_fr: de défense doivent être rebâties et réaffirmées, et nous devons travailler avec des partenaires pour

source: research, investment, and procurement.
fr_fr: faire avancer la recherche, encourager les investissements et faciliter l'approvisionnement.

source: Canada's new government is providing our military with the tools it needs to meet the modern threat
fr_fr: Le nouveau gouvernement du Canada fournit à nos forces militaires les outils dont elles ont besoin

source: environment by rebuilding, rearming, and reinvesting in the Canadian Armed Forces.
fr_fr: pour faire face aux menaces modernes en réinvestissant pour rebâtir et réarmer les FAC.

source: Budget 2025 proposes to provide $81.8 billion over five years
fr_fr: Le budget de 2025 propose de fournir 81,8 milliards de dollars sur cinq ans selon la

source: on a cash basis, starting in 2025-26, to rebuild, rearm, and reinvest in the Canadian
fr_fr: comptabilité de caisse, à compter de 2025-2026, qui serviront à réinvestir pour rebâtir et

source: Armed Forces (CAF).
fr_fr: réarmer les FAC.

source: This includes over $9 billion in 2025-26 that was announced by
fr_fr: Cette somme comprend un montant de plus de 9 milliards de dollars

source: the Prime Minister in June 2025.
fr_fr: en 2025-2026 qui avait été annoncé par le premier ministre en juin 2025.

source: Key investments include: $20.4 billion over five years, to recruit and retain a strong fighting force,
fr_fr: Parmi les investissements clés, notons les suivants : Une somme de 20,4 milliards de dollars sur cinq ans pour recruter et maintenir une

source: including generational pay raises for the CAF, and support CAF health care. $19.0 billion over five years to repair and sustain CAF capabilities and invest in
fr_fr: génération et d'un soutien aux soins de santé offerts dans les FAC. Une somme de 19,0 milliards de dollars sur cinq ans pour remettre en état et maintenir

source: defence infrastructure, including expanding ammunition and training infrastructure. $10.9 billion over five years for upgrades to Department of National Defence, CAF,
fr_fr: les capacités des FAC et investir dans l'infrastructure de défense, notamment pour accroître l'infrastructure des munitions et d'entraînement. Une somme de 10,9 milliards de dollars sur cinq ans qui servira à moderniser les

source: and Communications Security Establishment digital infrastructure, including those needed
fr_fr: infrastructures numériques du ministère de la Défense nationale, des FAC et du Centre de la

source: for modern warfare, such as cyber defence. $17.9 billion over five years to expand Canada's military capabilities, including
fr_fr: comme la cyberdéfense. Une somme de 17,9 milliards de dollars sur cinq ans pour élargir les capacités militaires du Canada.

source: investments in additional logistics utility, light utility, and armoured vehicles,
fr_fr: logistiques, des véhicules utilitaires légers et des véhicules blindés, ainsi que dans des

source: counter-drone and long-range precision strike capabilities, and domestic ammunition
fr_fr: capacités de frappes de précision à longue portée et de lutte contre les drones, et dans la

source: production, among other investments. $6.6 billion over five years, starting in 2025-26, to strengthen Canada's
fr_fr: fabrication de munitions canadiennes. Une somme de 6,6 milliards de dollars sur cinq ans, à compter de 2025-2026, pour

source: defence industry through a Defence Industrial Strategy .
fr_fr: renforcer le secteur de la défense au Canada grâce à la Stratégie industrielle de

source: Strategy is implemented, starting with initial investments announced in
fr_fr: Au fur et à mesure de la mise en œuvre de la Stratégie, à commencer par

source: Budget 2025, we will develop our defence industrial base so that more of our
fr_fr: les investissements initiaux annoncés dans le budget de 2025, nous développerons notre

source: military capabilities are procured from Canadian supply chains.
fr_fr: infrastructure industrielle de défense afin que les besoins de capacités militaires soient

source: (See below for
fr_fr: ci-dessous).

source: additional details). $6.2 billion over five years to expand Canada's defence partnerships, including
fr_fr: Une somme de 6,2 milliards de dollars sur cinq ans pour élargir les partenariats de

source: expanded military assistance to Ukraine and increased military training and
fr_fr: formation militaire et de bonifier les programmes de politique internationale.

source: international policy programming. $805 million over five years to the Canadian Coast Guard, the Canadian Security
fr_fr: Une somme de 805 millions de dollars sur cinq ans destinée à la Garde côtière

source: Intelligence Service, and Public Services and Procurement Canada for complementary
fr_fr: canadienne, au Service canadien du renseignement de sécurité et à Services publics et

source: initiatives to support Canada's defence capabilities.
fr_fr: Approvisionnement Canada pour des initiatives complémentaires visant à soutenir les capacités de défense du pays.

source: Launching the Defence Industrial Strategy
fr_fr: Lancer la Stratégie industrielle de défense

source: Canada's new government is moving to take immediate and decisive action to rebuild Canada's defence
fr_fr: Le nouveau gouvernement du Canada prend des mesures immédiates et décisives pour rebâtir la capacité

source: capacity, rearm the Canadian Armed Forces, and invest in the Canadian defence industry.
fr_fr: de défense nationale, réarmer les Forces armées canadiennes et investir dans l'industrie canadienne

source: generational investment in our defence and security creates enormous opportunities for Canadian
fr_fr: Cet investissement de portée historique dans notre défense et notre sécurité crée

source: businesses.
fr_fr: d'énormes possibilités pour les entreprises canadiennes.

source: The defence sector in Canada accounts for over 81,200 direct and indirect jobs.
fr_fr: Le secteur de la défense au Canada représente plus de 81 200 emplois directs et

source: Past defence projects
fr_fr: indirects.

source: have generated high-paying jobs in local communities.
fr_fr: Les projets de défense antérieurs ont généré des emplois bien rémunérés dans les

source: The opening of the new B
fr_fr: La construction de la nouvelle jetée B de la Base des Forces

source: Jetty in CFB Esquimalt in British Columbia created close to 1,300
fr_fr: canadiennes Esquimalt, en Colombie-Britannique, a permis de créer près

source: jobs during its construction.
fr_fr: de 1 300 emplois pendant les travaux.

source: The Future Aircrew Training program,
fr_fr: Le Programme de formation du personnel

source: an $11.2 billion investment in training the next generation of Canadian aviators, has
fr_fr: navigant de l'avenir , un investissement de 11,2 milliards de dollars dans la

source: the potential to create or maintain 3,400 jobs annually across Canada.
fr_fr: formation de la prochaine génération d'aviateurs canadiens, pourrait permettre de créer ou de

source: Our River-class Destroyer project is expected to create or maintain over 5,000
fr_fr: Le projet de destroyer de la classe Fleuves et rivières devrait créer ou maintenir plus

source: jobs over the next 15 years, many of which will be in Halifax, Nova Scotia.
fr_fr: de 5 000 emplois au cours des 15 prochaines années, dont une grande partie à Halifax, en Nouvelle-Écosse.

source: As we invest to build Canada's defence industrial base, our renewed commitment to defence will create
fr_fr: Canada, notre engagement renouvelé en faveur de la défense permettra de créer de nombreux emplois

source: many more fulfilling, high-paying careers for Canadian workers.
fr_fr: enrichissants et bien rémunérés pour les travailleurs canadiens.

source: Business opportunities will be
fr_fr: Les possibilités commerciales se

source: across the supply chain: from the production of raw materials, including steel and aluminum, to the
fr_fr: premières, notamment l'acier et l'aluminium, au transport de celles-ci assuré par les camionneurs et

source: truckers and rail workers who ensure their transit, to those who transform these materials into
fr_fr: les cheminots, en passant par la transformation de ces matières en équipements, en armes, en

source: equipment, weapons, ammunition, and vehicles.
fr_fr: munitions et en véhicules.

source: It will also drive innovation in technology sectors,
fr_fr: Ces occasions stimuleront également l'innovation dans les secteurs

source: including artificial intelligence, quantum, and cyber.
fr_fr: technologiques, notamment l'intelligence artificielle, la technologie quantique et la cybersécurité.

source: To that end, the government is launching a new Defence Industrial Strategy . This
fr_fr: Pour ce faire, le gouvernement lance la nouvelle Stratégie industrielle de défense .

source: strategy will ensure Canada's defence investments are now guided by a whole-of-government approach
fr_fr: Cette stratégie garantira que les investissements du Canada en matière de défense s'inscrivent

source: to building sovereign defence capacity—creating high-paying careers, opportunities for businesses,
fr_fr: désormais dans une approche pangouvernementale visant à renforcer la capacité de défense souveraine,

source: and sourcing Canadian resources in the process.
fr_fr: ce qui permettra de créer des emplois bien rémunérés, d'offrir des débouchés aux entreprises et

source: Initial Investments Under the Defence Industrial Strategy:
fr_fr: d'utiliser des ressources provenant du Canada.

source: Of the $6.6 billion to strengthen Canada's defence industry noted above, the government is
fr_fr: De la somme de 6,6 milliards de dollars qui servira à renforcer le secteur de la défense au

source: already allocating $4.6 billion over five years on a cash basis, starting in 2025-26, for
fr_fr: Canada mentionnée plus haut, le gouvernement a déjà affecté 4,6 milliards de dollars sur cinq

source: initial investments under the forthcoming Defence Industrial Strategy to improve
fr_fr: dans le cadre de la Stratégie industrielle de défense à venir, qui amélioreront

source: access to capital, drive research and innovation, bolster domestic supply chains, and grow critical
fr_fr: l'accès aux capitaux, stimuleront la recherche et l'innovation, soutiendront les chaînes

source: resource stockpiles.
fr_fr: Le gouvernement

source: The government will release the Defence Industrial Strategy in
fr_fr: publiera la Stratégie industrielle de défense au cours des prochains mois. Voici

source: the coming months.
fr_fr: les principaux investissements initiaux :

source: Key initial investments include:
fr_fr: Une somme de 68,2 millions de dollars sur trois ans, à compter de 2025-2026,

source: $68.2 million over three years, starting in 2025-26, to the Department of National
fr_fr: attribuée au ministère de la Défense nationale (MDN), à Innovation, Sciences et Développement

source: Defence (DND), Innovation, Science and Economic Development Canada (ISED), the National Research
fr_fr: économique Canada (ISDE), au Conseil national de recherches Canada (CNRC) et au Centre de la

source: Council (NRC), and the Communications Security Establishment to establish the Bureau of
fr_fr: sécurité des télécommunications pour établir le Bureau de recherche, d'ingénierie et de

source: Research, Engineering and Advanced Leadership in Innovation and Science (BOREALIS) .
fr_fr: leadership avancés en matière d'innovation et de science (BOREALIS) .

source: $1.0 billion in 2025-26 to create a new Defence and Security Business
fr_fr: Une somme de 1,0 milliard de dollars en 2025-2026 pour la création du nouveau Programme de mobilisation des entreprises pour la défense et la sécurité à la

source: Mobilization Program at the Business Development Bank of Canada to provide
fr_fr: Banque de développement du Canada, qui fournira des prêts, du capital de risque et des services

source: loans, venture capital, and advisory services to help small-and medium-sized businesses
fr_fr: de conseil aux petites et moyennes entreprises pour aider celles-ci à contribuer aux capacités

source: contribute to Canada's defence and security capabilities.
fr_fr: du Canada en matière de défense et de sécurité.

source: $656.9 million over five years, starting 2025-26, to ISED to develop and commercialise dual
fr_fr: Une somme de 656,9 millions de dollars sur cinq ans, à compter de 2025-2026,

source: civilian-military technologies in a range of industries, including aerospace, automotive,
fr_fr: accordée à ISDE pour soutenir la mise au point et la commercialisation de technologies à usage

source: marine, cybersecurity, artificial intelligence, biodefence, and life sciences.
fr_fr: civil et militaire dans une foule d'industries, dont l'aérospatiale, l'automobile, la marine, la

source: $334.3 million over five years, starting in 2025-26, to ISED, NRC and the National
fr_fr: Une somme de 334,3 millions de dollars sur cinq ans, à compter de 2025-2026,

source: Science and Engineering Research Council for a suite of measures to help anchor quantum
fr_fr: attribuée à ISDE, au CNRC et au Conseil de recherches en sciences naturelles et en génie pour un

source: technology companies in Canada and provide pathways to technology adoption in defence-related
fr_fr: ensemble de mesures visant à ancrer au Canada des entreprises de technologie quantique et à

source: applications and industries.
fr_fr: ouvrir la voie à l'adoption de technologies destinées à des applications et à des secteurs liés

source: $443.0 million over five years, starting in 2025-26, to Natural Resources Canada and
fr_fr: à la défense. Une somme de 443,0 millions de dollars sur cinq ans, à compter de 2025-2026,

source: ISED to support the development of innovative critical minerals processing technologies, support
fr_fr: accordée à Ressources naturelles Canada et à ISDE pour soutenir le développement de technologies

source: joint investments with Allies in Canadian critical minerals projects, and develop a critical
fr_fr: avec des alliés dans des projets de minéraux critiques au Canada, ainsi que le développement

source: minerals stockpiling mechanism to strengthen Canadian and Allied national security.
fr_fr: d'un mécanisme de stockage des minéraux critiques pour renforcer la sécurité nationale du Canada

source: $182.6 million over three years, starting 2025-26, to DND to establish a sovereign space
fr_fr: et de ses alliés. Une somme de 182,6 millions de dollars sur trois ans, à compter de 2025-2026, qui

source: launch capability. A New Defence Investment Agency
fr_fr: Une nouvelle Agence de l'investissement pour la défense

source: Canada's new government is focused on providing the women and men in uniform with the equipment they
fr_fr: L'objectif du nouveau gouvernement du Canada est de fournir aux femmes et aux hommes des FAC

source: need, when they need it.
fr_fr: l'équipement dont ils ont besoin, quand ils en ont besoin.

source: With the right tools in their arsenal, we will reinforce Canada's
fr_fr: Grâce à du matériel adéquat, nous

source: sovereignty, create high-paying new careers for Canadian workers, and strengthen our defence
fr_fr: renforcerons la souveraineté du Canada, créerons de nouveaux emplois bien rémunérés pour les

source: partnerships with Allies.
fr_fr: travailleurs canadiens et consoliderons les partenariats de défense avec nos alliés.

source: Canada's defence procurement is currently fragmented across several departments, slow to consult
fr_fr: L'approvisionnement en matériel de défense au Canada est actuellement fragmenté entre plusieurs
